In [4]:
import sys; sys.path.append("../")

import pandas as pd

from lib.name import clean_name
from lib.date import to_datetime_series
from lib.columns import rearrange_personel_columns

In [5]:
df1 = pd.read_excel("../data/New Orleans Harbor PD/Administrative Data/New Orleans_Harbor PD_PPRR_2020.xlsx")
df1.rename(columns={name: " ".join(name.title().split()) for name in df1.columns}, inplace=True)
df1

,First Name,Mi,Last Name,Date Hired,Term Date,Position/Rank,Hourly Pay,Pay Effective Date,Call Sign,Unnamed: 9,Unnamed: 10
0,CASEY,M,ADAMS,1980-01-31,2010-02-28,POLICE SERGEANT--PORT,17.00,1997-04-14,NaN,NaN,NaN
1,CASEY,M,ADAMS,1980-01-31,2010-02-28,POLICE SERGEANT--PORT,17.68,2003-12-10,NaN,NaN,NaN
2,CASEY,M,ADAMS,1980-01-31,2010-02-28,POLICE SERGEANT--PORT,18.39,2004-08-10,NaN,NaN,NaN
3,CASEY,M,ADAMS,1980-01-31,2010-02-28,POLICE SERGEANT--PORT,19.13,2005-08-10,NaN,NaN,NaN
4,CASEY,M,ADAMS,1980-01-31,2010-02-28,POLICE SERGEANT-A,19.13,2005-08-29,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
1454,NaN,NaN,NaN,NaT,NaT,NaN,NaN,NaT,NaN,NaN,NaN
1455,NaN,NaN,NaN,NaT,NaT,NaN,NaN,NaT,NaN,NaN,NaN
1456,NaN,NaN,NaN,NaT,NaT,NaN,NaN,NaT,NaN,NaN,NaN
1457,NaN,NaN,NaN,NaT,NaT,NaN,NaN,NaT,NaN,NaN,NaN
1458,NaN,NaN,NaN,NaT,NaT,NaN,NaN,NaT,NaN,NaN,NaN

In [6]:
df1.columns

Index(['First Name', 'Mi', 'Last Name', 'Date Hired', 'Term Date',
       'Position/Rank', 'Hourly Pay', 'Pay Effective Date', 'Call Sign',
       'Unnamed: 9', 'Unnamed: 10'],
      dtype='object')

In [7]:
# is "Pay Effective Date" the same as "Pay Prog Start Date"? No
# do we want to include "Pay Effective Date" column?
df2 = df1[["First Name", "Last Name", "Position/Rank", "Date Hired", "Term Date", "Hourly Pay", "Mi"]]
df2.rename(columns={
    "Term Date": "Termination Date",
    "Date Hired": "Hire Date",
    "Position/Rank": "Rank",
    "Hourly Pay": "Hourly Salary",
    "Mi": "Middle Name"
}, inplace=True)
df2 = rearrange_personel_columns(df2)
for col in ["Last Name", "Middle Name", "First Name"]:
    df2.loc[:, col] = df2[col].map(clean_name, na_action="ignore")
for col in ["Termination Date", "Hire Date"]:
    df2.loc[:, col] = to_datetime_series(df2[col])
df2

,Last Name,Middle Name,First Name,Rank,Hire Date,Termination Date,Hourly Salary
0,Adams,M,Casey,POLICE SERGEANT--PORT,1980-01-31,2010-02-28,17.00
1,Adams,M,Casey,POLICE SERGEANT--PORT,1980-01-31,2010-02-28,17.68
2,Adams,M,Casey,POLICE SERGEANT--PORT,1980-01-31,2010-02-28,18.39
3,Adams,M,Casey,POLICE SERGEANT--PORT,1980-01-31,2010-02-28,19.13
4,Adams,M,Casey,POLICE SERGEANT-A,1980-01-31,2010-02-28,19.13
...,...,...,...,...,...,...,...
1454,NaN,NaN,NaN,NaN,NaT,NaT,NaN
1455,NaN,NaN,NaN,NaN,NaT,NaT,NaN
1456,NaN,NaN,NaN,NaN,NaT,NaT,NaN
1457,NaN,NaN,NaN,NaN,NaT,NaT,NaN
1458,NaN,NaN,NaN,NaN,NaT,NaT,NaN

In [8]:
df2.to_csv("../output/new-orleans-harbor-pd_personel_2010-2020.csv", index=False)